Revit 2025 API
RebarSpliceError Enumeration
 Class that defines states for splicing a Rebar.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RebarSpliceError
Public Enumeration RebarSpliceError
public enum class RebarSpliceError
type RebarSpliceError
Members
Member name | Value | Description
Success | 0 |  This will be is there is no error.
Unknown | 1 |  There is an unexpected error.
InvalidRebar | 2 |  Free Form rebars, or Shape Driven rebars that are Multiplanar, or have a shape that whose definition is RebarShapeDefinitionByArc, or rebars that are part of a group can't be spliced.
InvalidLineOrLinePlaneNormal | 3 |  The line length is zero or the line direction is parallel with the line plane normal.
LineDoesNotIntersectRebarBoundingBox | 4 |  The line doesn't intersect the rebar bounding box.
SpliceGeometryOnHookOrFillet | 5 |  If the splice geometry is on a hook or a fillet, the rebar can't be spliced with it.
TooSmallSegments | 6 |  One of the resulting segments is too small to apply the lap.
SpliceGeometryDoesNotIntersectAllTheBarsInTheSet | 7 |  A plane obtained from splice geometry doesn't intersect all the bars in the set.
SpliceGeometryAlmostParallelToBarSegment | 8 |  The plane formed by splice geometry is almost parallel to bar segment plane.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace